#ifndef conf_h
#define conf_h
//--------------------------------------------------------------
// CPU clock speed
//#define F_CPU        16000000			// 16MHz processor
//#define F_CPU        14745000			// 14.745MHz processor
#define F_CPU        8000000			// 8MHz processor
//#define F_CPU        7372800			// 7.37MHz processor
//#define F_CPU        4000000			// 4MHz processor
//#define F_CPU        3686400			// 3.69MHz processor
//--------------------------------------------------------------
//**************************************************************
//==============================================================
// Встроенная периферия
// для активации необходимо раскомментировать
//**************************************************************
//--------------------------------------------------------------
// Включить встроенный АЦП
#define ADC_Enable
//--------------------------------------------------------------
// Включить встроенный Компаратор
//#define COMP_Enable
//--------------------------------------------------------------
// Включить ВНЕШНИЕ ПРЕРЫВАНИЯ
//#define EXT_INTER_Enable
//--------------------------------------------------------------
// Включить SPI
//#define SPI_Enable
//--------------------------------------------------------------
// Включить TIMER8_0
#define TIMER8_0_Enable
//--------------------------------------------------------------
// Включить TIMER16_1
#define TIMER16_1_Enable
//--------------------------------------------------------------
// Включить TIMER8_2
//#define TIMER8_2_Enable
//--------------------------------------------------------------
// Включить TWI
//#define TWI_Enable
//--------------------------------------------------------------
// Включить USART
#define USART_Enable
//--------------------------------------------------------------
// Включить PRINT
#define PRINT_Enable
//--------------------------------------------------------------
// Включить CMDline
#define CMDLINE_Enable
//**************************************************************
//==============================================================
// Библиотеки общих подпрограмм
//--------------------------------------------------------------
//**************************************************************
// Включить EEPROM
//#include <avr/eeprom.h>
//--------------------------------------------------------------
// Работа с Flash памятью
#include <avr/pgmspace.h>
//--------------------------------------------------------------
// Работа в Спящем режиме
//#include <avr/sleep.h>
//--------------------------------------------------------------
// Включить WATCHDOG
//#include <avr/wdt.h>
//--------------------------------------------------------------
// Задержки программные
//#include <util/delay.h>
//--------------------------------------------------------------
// Подключение математической библиотеки
// необходимо подключение libm.a
//#include <math.h>
//--------------------------------------------------------------
// Сдвиг с сохранением знака
//#define Sdvig_Enable
//--------------------------------------------------------------
// CRC8_Flash
//#define CRC8_Flash
//--------------------------------------------------------------
// форматированный вывод
#include <stdio.h>
//--------------------------------------------------------------
// использование прерываний
#include <avr/interrupt.h>
//--------------------------------------------------------------
// ПИД контроллер
#define PID_controller
//--------------------------------------------------------------
// атомарные операции без прерываний
//#include <util/atomic.h>
//--------------------------------------------------------------
// Вычисление CRC8,CRC16 оптимизированно по объему 
//#include <util/crc16.h>
//**************************************************************
//==============================================================
// Внешняя периферия
//--------------------------------------------------------------
//**************************************************************
// Включить LCD2004_I2C
//#define LCD_I2C_Enable
//--------------------------------------------------------------
// Включить DS18B20
//#define DS18B20_Enable
//--------------------------------------------------------------


#endif
