#ifndef EXTER_INT_H
#define EXTER_INT_H
#include "avr_cmsis.h"
//***********************************************************************
typedef enum														//	*
{																	//	*
LOW_LEVEL=0, 	// Прерывание по низкому уровенью						*
ANY_CHANGE=1,	// Прерывание по Любому изменению уровня				*
FALLING_EDGE=2,	// Прерывание по спадающему уровенью					*
RISING_EDGE=3	// Прерывание по восходящему уровенью					*
}int_set0_t;														//	*
//----------------------------------------------------------------------*
typedef enum														//	*
{																	//	*
FALLING_Edge=0,	// Прерывание по спадающему уровенью					*
RISING_Edge =1	// Прерывание по восходящему уровенью					*
}int_set2_t;														//	*
//***********************************************************************




//***********************************************************************
//																		*
//		Включение прерывания ВНЕШНИХ ПРЕРЫВАНИЙ							*
//																		*
//----------------------------------------------------------------------*
#define INT0_ISR(state)  gicr->int0=state							//	*
// Вектор прерывания: INT0_vect											*
//----------------------------------------------------------------------*
#define INT1_ISR(state)  gicr->int1=state							//	*
// Вектор прерывания: INT1_vect											*
//----------------------------------------------------------------------*
#define INT2_ISR(state)  gicr->int2=state							//	*
// Вектор прерывания: INT2_vect											*
//***********************************************************************

//***********************************************************************
//																		*
//		Настройка СОБЫТИЯ прерывания ВНЕШНИХ ПРЕРЫВАНИЙ					*
//																		*
//----------------------------------------------------------------------*
//	Настройка для пина INT0												*
void INT0_SETTING(int_set0_t set);									//	*
//----------------------------------------------------------------------*
//	Настройка для пина INT1												*
void INT1_SETTING(int_set0_t set);									//	*
//----------------------------------------------------------------------*
//	Настройка для пина INT2												*
void INT2_SETTING(int_set2_t set);									//	*
//***********************************************************************

//***********************************************************************
//																		*
//		Работа с ФЛАГАМИ для ВНЕШНИХ ПРЕРЫВАНИЙ							*
//																		*
//----------------------------------------------------------------------*
// Сброс флага прерывания											//	*
#define INT0_RESET_FLAG()	GIFR=(1<<INTF0)							//	*
#define INT1_RESET_FLAG()	GIFR=(1<<INTF1)							//	*
#define INT2_RESET_FLAG()	GIFR=(1<<INTF2)							//	*
//----------------------------------------------------------------------
// Проверка флага прерывания										//	*
#define INT0_IS_FLAG()	gifr->intf0									//	*
#define INT1_IS_FLAG()	gifr->intf1									//	*
#define INT2_IS_FLAG()	gifr->intf2									//	*
//***********************************************************************
#endif
