#ifndef LCD2004_I2C_H
#define LCD2004_I2C_H
//----------------------------------------------------------
#include <avr_cmsis.h>
#include <driver_h\i2c.h>		// TWI драйвер
#include <util/delay.h>
#include <avr/pgmspace.h>

//---------------------------------------------------------------

//***************************************************************
//																*
//			Настройки экрана по-умолчанию						*
//																*
//***************************************************************
// адрес экрана (PCF8574 - 0b0100xxx;PCF8574A - 0b0111xxx)		*
#define Addres_lcd		0b0111111							//	*
//--------------------------------------------------------------*
// Сдвиг экрана													*
#define Shift_Disp 0 // отключен								*
//--------------------------------------------------------------*
// Смещение курсора при записи символа							*
#define Shift_Curr 1 // включен									*
//--------------------------------------------------------------*
// Курсор мигающий												*
#define Blink 0		// 0-отключен/1-включен						*
//--------------------------------------------------------------*
// Курсор _														*
#define Cursor 0	// 0-отключен/1-включен						*
//--------------------------------------------------------------*
// Дисплей														*
#define Display 1	// 0-отключен/1-включен						*
//--------------------------------------------------------------*
// Шрифт:														*
#define Font 0 		// 5*7px									*
//--------------------------------------------------------------*
// кол-во строк:												*
#define Lines 1		// 1-2_строки								*
//--------------------------------------------------------------*
// Программная задержка для Lcd_clear()							*
#define delay_lcd_clear()		_delay_ms(1600)				//	*				
//***************************************************************

//***************************************************************
//																*
//		Структура для настройки дисплея							*
//																*
//--------------------------------------------------------------*
typedef union												//	*
{															//	*
struct														//	*
{															//	*
uint8_t	shift_disp:1;// Одновременный сдвиг экрана при записи 	*
			   		//	символа запрещен=0/разрешен=1			*
uint8_t	shift_curr:1;// смещение курсора при записи символа 	*
			   		//	влево=0/вправо=1						*
//--------------------------------------------------------------*
uint8_t blink:	1; 	// Курсор мигающий выключить=0/включить=1	*
uint8_t cursor:	1; 	// Курсор _ выключить=0/включить=1			*
uint8_t display:1; 	// Дисплей выключить=0/включить=1			*
//--------------------------------------------------------------*
uint8_t font:	1;	// Шрифт: 5*7px=0/5*10px=1					*
uint8_t lines:	1;	// кол-во строк: 1строка=0/2строки=1		*
uint8_t bits:	1;	// Разряд шины: 4бит=0/8бит=1				*
};															//	*
uint8_t set;		// доступ к целому регистру					*
}SetLCD_t;													//	*
//***************************************************************


//***************************************************************
//																*
//		Описание функций для работы с экраном по-умолчанию		*
//																*
//--------------------------------------------------------------*
// Инициализация экрана по-умолчанию							*
#define Init_lcd_def()		 Init_LCD(Addres_lcd)			//	*
//--------------------------------------------------------------*
// Загрузить настройки в экрана									*									
#define Setting_LCD_def(set) setting_lcd(Addres_lcd, set)	//	*
//--------------------------------------------------------------*
// Переместить курсор в позиция х-у								*
#define GoTo(x,y)			 CursorGoTo(Addres_lcd,x,y)		//	*
//--------------------------------------------------------------*
// Очистить экран												*
#define Lcd_clear()		 LCD_clear(Addres_lcd) 				//	*
//--------------------------------------------------------------*
// Дисплей Включить/выключить									*
void Lcd_Display(void); 									//  *
//--------------------------------------------------------------*
// Нижнее подчеркивание Включить/выключить 						*
void Cursor_underline(void); 								//	*
//--------------------------------------------------------------*
// Курсор подчеркнутый Мигание курсора							*
void Cursor_blink(void); // Включить/выключить 					*
//--------------------------------------------------------------*
// Подстветка включить/выключить								*
void BackLight(void);										//	*
//--------------------------------------------------------------*
// Вывод строки из RAM											*
#define Lcd_SendString(string) LCD_SendString(Addres_lcd, string)//*
//--------------------------------------------------------------*
// Вывод строки из ROM											*
//	prog_char string[]="ALEKSEY"								*
#define Lcd_SendStringFlash(string) LCD_SendStringFlash(Addres_lcd, string)
//***************************************************************


//***************************************************************
//																*
//		Описание функций для работы с экраном					*
//																*
//--------------------------------------------------------------*
// Инициализация экрана по адресу
SetLCD_t Init_LCD(uint8_t add_lcd);
//--------------------------------------------------------------*
// Полная очистка экрана
void LCD_clear(uint8_t add_lcd);
//--------------------------------------------------------------*
void setting_lcd(uint8_t add_lcd, SetLCD_t SetLCD);
//--------------------------------------------------------------*
//	Переход курсора по экрану: х-строки; у-столбцы				*
void CursorGoTo(uint8_t add_lcd, uint8_t x, uint8_t y);		//	*
//--------------------------------------------------------------*
// Отправка данных из RAM Памяти								*
// Результат функции успех передачи данных Успех-1/Провал-0		*
 void LCD_SendString(uint8_t addres_lcd, char *str);		//	*
//--------------------------------------------------------------*
// Отправка данных из Flash Памяти								*
void LCD_SendStringFlash(uint8_t addres_lcd, prog_char *str);//*
//***************************************************************
#endif
