#ifndef MAX31855_H
#define MAX31855_H
#include "avr_cmsis.h"
#include <driver_h\spi.h>		// SPI драйвер
//*******************************************************************
typedef struct
{
int16_t coup_int; // целая часть термпературы термопары
uint8_t coup_dec; // дробная часть температуры термопары
int8_t  temp_int; // целая часть температуры окруж. воздуха
uint8_t temp_dec; // дробная часть температуры окруж. воздуха
uint8_t fault:1;  // если один из параметров равен 1, то устанавливается 1.
uint8_t short_Vcc:1; // Касание термопары напряжения =1
uint8_t short_GND:1; // касание термопары земли =1
uint8_t no_connect:1; // обрыв термопары =1
} max31855_t;
//-------------------------------------------------------------------
uint8_t MAX31855[4]; // массив для считывания данных схемы
//-------------------------------------------------------------------
// Инициализация микросхемы
void init_max31855(void);
//-------------------------------------------------------------------
//-------------------------------------------------------------------
// разбор на данные
void format_max31855(max31855_t *rez, uint8_t *a);
//-------------------------------------------------------------------
// Считывание данных в указатель 
// Необходимо использовать данное определение!!!!!!
#define read_max31855(rez)	SPI_Array(MAX31855, MAX31855, 4); \
							format_max31855(rez, MAX31855);
//*******************************************************************
#endif
