#ifndef MAX6675_H
#define MAX6675_H
#include <avr_cmsis.h>
#include <driver_h\spi.h>		// SPI драйвер
// Для работы модуля необходимо подключение библиотеки libm.a
//*******************************************************************
//		Настройка модуля MAX6675 через аппаратный SPI				*
//------------------------------------------------------------------*
// Инициализация SPI для MAX6675									*
void init_max6675(void);										//	*
//------------------------------------------------------------------*
// Чтение данных из схемы, 											*
// Если термопара подключена, то результат 1, иначе 0			//	*
uint8_t read_max6675(uint16_t *temper);							//	*
//------------------------------------------------------------------*
// Перевод значения в целые градусы									*
inline uint16_t temp6675_i(uint16_t temper);					//	*
//------------------------------------------------------------------*
// Перевод значение в дробные градусы								*
inline double temp6675_f(uint16_t temper);						//	*
//*******************************************************************
#endif
