#ifndef PRINT_H
#define PRINT_H
#include <atmega16_32.h>
// Работа с Flash памятью
#include <avr/pgmspace.h>
//***********************************************************************
//		Фунции для вывода строк из ОЗУ и ПЗУ							*
//----------------------------------------------------------------------*
// Настройка функции для приема данных									*
void printInit(void (*putchar_func)(char c));						//	*
//----------------------------------------------------------------------*
// Вывод строки из ОЗУ													*
void printStr(char str[]);											//	*
//----------------------------------------------------------------------*
// Вывод строки из ПЗУ через указатель									*
void printProgStr(const prog_char str[]);							//	*
//----------------------------------------------------------------------*
// Вывод и хранение строки ПЗУ											*
#define printfProgStrM(string)		(printProgStr(PSTR(string)))	  //*
//***********************************************************************

//***********************************************************************
//	Утилиты для работы с флеш											*
//----------------------------------------------------------------------*
// Поиск длины строки в памяти ОЗУ										*
uint8_t str_len(char* str);											//	*
//----------------------------------------------------------------------*
// Поиск длины строки в памяти ПЗУ										*
uint8_t str_len_pgm(char* pgm_str);									//	*
//----------------------------------------------------------------------*
// Сравнение строки ОЗУ и ПЗУ											*
uint8_t str_equal_pgm(char* str,char* pgm_str);						//	*
//----------------------------------------------------------------------*
// Проверка символов на Латинские символы								*
uint8_t is_regular_char(char x);									//	*
//----------------------------------------------------------------------*
// Проверка символов на цифры											*
uint8_t is_digit(char x);
//----------------------------------------------------------------------*
// Копирование данных строки из ПЗУ в ОЗУ								*
void flash_to_ram(char *pgm, char *str);							//	*
//----------------------------------------------------------------------*
// Перевод из строки в число											*
uint16_t str_to_uint16(char *s_num);				
//***********************************************************************
#endif
