#ifndef SDVIG_H
#define SDVIG_H
#include <avr_cmsis.h>
//***********************************************************************
//		Фунции для работы со сдвигом с сохраненим знака					*
//----------------------------------------------------------------------*
// сдвиг со сохранением знака для 1 байта								*
// байт для сдвига с сохранением знака, кол-во сдвигов					*
int8_t sdvig8(int8_t ch, uint8_t kol);								//	*
//----------------------------------------------------------------------*
// сдвиг со сохранением знака для 2 байт								*
// байт для сдвига с сохранением знака, кол-во сдвигов					*
int16_t sdvig16(int16_t ch, uint8_t kol);							//	*
//***********************************************************************
#endif
