#ifndef TIMER8_0_C
#define TIMER8_0_C
#include <atmega16_32.h>
// Last edit 07-07-18
//***********************************************************************

//***********************************************************************
//																		*
//	Ф У Н К Ц И И		Д Л Я	Р А Б О Т Ы 	С	T I M E R 8_0		*
//																		*
//***********************************************************************

//***********************************************************************
//																		*
//		Настройка работы  в режиме СЧЕТЧИК								*
//																		*
//----------------------------------------------------------------------*
// Инициализация режима NORMAL											*
void TIMER8_0_NORMAL(FuncState_t state_ISR)//Состояние прерывания *
{																	//	*
// Настройка режима														*
tccr0->wgm00=0;														//	*
tccr0->wgm01=0;														//	*
// Настройка прерывания												//	*
timsk->toie0=state_ISR;												//	*
}																	//	*
//----------------------------------------------------------------------*
// 	Инициализация режима CTC (сброс при совпадении для регистра OCR0)	*
void TIMER8_0_CTC_OCR0(uint8_t OCR, // значение регистра перезагрузки	*
		 FuncState_t state_ISR) // состояние прерывний			*
{																	//	*
// Настройка режима														*
tccr0->wgm00=0;														//	*
tccr0->wgm01=1;														//	*
// Настройка регистра сравнения											*
OCR0=OCR;															//	*
// Настройка прерывания													*
timsk->ocie0=state_ISR;												//	*
}																	//	*
//----------------------------------------------------------------------*
//======================================================================*
//																		*
//	Настройка режима СОВПАДЕНИЯ и ВЫХОДОВ OC0	в режиме СЧЕТЧИК		*
//																		*
//----------------------------------------------------------------------*
// Настройка режима СОВПАДЕНИЯ и  ВЫХОДА OC0							*
void TIMER8_0_COUNT_OCR0(uint8_t OCR, // значение регистра СРАВНЕНИЯ	*
		  FuncState_t state_ISR, // настройка ПРЕРЫВАНИЯ			*
					 count_OC_t count) // настройка режима ВЫВОДА ОС0 	*
{																	//	*
// Настройка пина на вывод
DDR_OC0->PIN_OC0=1;
// Настройка регистра СРАВНЕНИЯ											*
OCR0=OCR;															//	*
// Настройка прерывания													*
timsk->ocie0=state_ISR;												//	*
// Настройка режима ВЫХОДА												*
tccr0->com0=count;													//	*
}																	//	*
//***********************************************************************

//***********************************************************************
//																		*
//				Работы таймера в режиме Ш И М							*
//																		*
//----------------------------------------------------------------------*
//		Режим 	F A S T		P W M										*
//----------------------------------------------------------------------*
// Режим Fast PWM														*
void TIMER8_0_FAST_PWM(FuncState_t state_ISR)//состояние прерывния
{
// Настройка режима														*
tccr0->wgm00=1;
tccr0->wgm01=1;
// Настройка прерывания												//	*
timsk->toie0=state_ISR;
}
//----------------------------------------------------------------------*
//		Режим 	P H A S E	C O R R E C T		P W M					*
//----------------------------------------------------------------------*
// Режим Phase Correct PWM 												*
void TIMER8_0_PhasCorr_PWM(FuncState_t state_ISR)//с-ние прерывния
{
// Настройка режима														*
tccr0->wgm00=1;
tccr0->wgm01=0;
// Настройка прерывания												//	*
timsk->toie0=state_ISR;
}
//----------------------------------------------------------------------*
//======================================================================*
//																		*
//	Настройка режима СОВПАДЕНИЯ и ВЫХОДОВ OC1A/OC1B	в режиме ШИМ		*
//																		*
//----------------------------------------------------------------------*
// Настройка режима СОВПАДЕНИЯ и  ВЫХОДА OC0							*
void TIMER8_0_PWM_OCR0(uint8_t OCR, // значение регистра СРАВНЕНИЯ		*
		  FuncState_t state_ISR, // настройка ПРЕРЫВАНИЯ			*
					 pwm_OC_t pwm) // настройка режима ВЫВОДОВ ОС0		*
{
// Настройка пина на вывод
DDR_OC0->PIN_OC0=1;
// Настройка регистра СРАВНЕНИЯ											*
OCR0=OCR;															//	*
// Настройка прерывания													*
timsk->ocie0=state_ISR;												//	*
// Настройка режима ВЫХОДА												*
tccr0->com0=pwm;													//	*
}
//***********************************************************************


#endif
