#ifndef TIMER8_2_C
#define TIMER8_2_C
#include "avr_cmsis.h"


//***********************************************************************
// Определение для проверки регистра управления TCCR2 перед записью		*
//----------------------------------------------------------------------* 
//	Загрузка значения в регистр сравнения OCR2 в асинхронном режиме		*
#define ASYN_TCR2_BYSE()		while(assr->tcr2ub)					//	*
//***********************************************************************

//***********************************************************************
//																		*
//	Ф У Н К Ц И И		Д Л Я	Р А Б О Т Ы 	С	T I M E R 8_0		*
//																		*
//***********************************************************************

//***********************************************************************
//																		*
//		Настройка работы  в режиме СЧЕТЧИК								*
//																		*
//----------------------------------------------------------------------*
// Инициализация режима NORMAL											*
void TIMER8_2_NORMAL(FunctionalState_t state_ISR)//Состояние прерывания *
{																	//	*
// Настройка режима														*
#ifdef ASYNCHRONOUS_MODE	//если включена проверка записи			//	*
ASYN_TCR2_BYSE();			// Проверка готовности к записи			//	*
#endif																//	*
tccr2->wgm20=0;														//	*
#ifdef ASYNCHRONOUS_MODE	//если включена проверка записи			//	*
ASYN_TCR2_BYSE();			// Проверка готовности к записи			//	*
#endif																//	*
tccr2->wgm21=0;														//	*
// Настройка прерывания												//	*
timsk->toie2=state_ISR;												//	*
}																	//	*
//----------------------------------------------------------------------*
// 	Инициализация режима CTC (сброс при совпадении для регистра OCR2)	*
void TIMER8_2_CTC_OCR2(uint8_t OCR, // значение регистра перезагрузки	*
		 FunctionalState_t state_ISR) // состояние прерывний			*
{																	//	*
// Настройка режима														*
#ifdef ASYNCHRONOUS_MODE	//если включена проверка записи			//	*
ASYN_TCR2_BYSE();			// Проверка готовности к записи			//	*
#endif																//	*
tccr2->wgm20=0;														//	*
#ifdef ASYNCHRONOUS_MODE	//если включена проверка записи			//	*
ASYN_TCR2_BYSE();			// Проверка готовности к записи			//	*
#endif																//	*
tccr2->wgm21=1;														//	*
// Настройка регистра сравнения											*
#ifdef ASYNCHRONOUS_MODE											//	*
ASYN_OCR2_LOAD(OCR);	// Запись в регистр сравнения с проверкой	//	*
#else																//	*
OCR2=OCR;															//	*
#endif																//	*
// Настройка прерывания													*
timsk->ocie2=state_ISR;												//	*
}																	//	*
//----------------------------------------------------------------------*
//======================================================================*
//																		*
//	Настройка режима СОВПАДЕНИЯ и ВЫХОДОВ OC2	в режиме СЧЕТЧИК		*
//																		*
//----------------------------------------------------------------------*
// Настройка режима СОВПАДЕНИЯ и  ВЫХОДА OC2							*
void TIMER8_2_COUNT_OCR2(uint8_t OCR, // значение регистра СРАВНЕНИЯ	*
		  FunctionalState_t state_ISR, // настройка ПРЕРЫВАНИЯ			*
					 count_OC_t count) // настройка режима ВЫВОДА ОС2 	*
{																	//	*
// Настройка пина на вывод
DDR_OC2->PIN_OC2=1;
// Настройка регистра СРАВНЕНИЯ											*
#ifdef ASYNCHRONOUS_MODE											//	*
ASYN_OCR2_LOAD(OCR);	// Запись в регистр сравнения с проверкой	//	*
#else																//	*
OCR2=OCR;															//	*
#endif																//	*
// Настройка прерывания													*
timsk->ocie2=state_ISR;												//	*
// Настройка режима ВЫХОДА												*
#ifdef ASYNCHRONOUS_MODE	//если включена проверка записи			//	*
ASYN_TCR2_BYSE();			// Проверка готовности к записи			//	*
#endif																//	*
tccr2->com2=count;													//	*
}																	//	*
//***********************************************************************

//***********************************************************************
//																		*
//				Работы таймера в режиме Ш И М							*
//																		*
//----------------------------------------------------------------------*
//		Режим 	F A S T		P W M										*
//----------------------------------------------------------------------*
// Режим Fast PWM														*
void TIMER8_2_FAST_PWM(FunctionalState_t state_ISR)//состояние прерывния
{
// Настройка режима														*
#ifdef ASYNCHRONOUS_MODE	//если включена проверка записи			//	*
ASYN_TCR2_BYSE();			// Проверка готовности к записи			//	*
#endif																//	*
tccr2->wgm20=1;
#ifdef ASYNCHRONOUS_MODE	//если включена проверка записи			//	*
ASYN_TCR2_BYSE();			// Проверка готовности к записи			//	*
#endif																//	*
tccr2->wgm21=1;
// Настройка прерывания												//	*
timsk->toie2=state_ISR;
}
//----------------------------------------------------------------------*
//		Режим 	P H A S E	C O R R E C T		P W M					*
//----------------------------------------------------------------------*
// Режим Phase Correct PWM 												*
void TIMER8_2_PhasCorr_PWM(FunctionalState_t state_ISR)//с-ние прерывния
{
// Настройка режима														*
#ifdef ASYNCHRONOUS_MODE	//если включена проверка записи			//	*
ASYN_TCR2_BYSE();			// Проверка готовности к записи			//	*
#endif																//	*
tccr2->wgm20=1;
#ifdef ASYNCHRONOUS_MODE	//если включена проверка записи			//	*
ASYN_TCR2_BYSE();			// Проверка готовности к записи			//	*
#endif																//	*
tccr2->wgm21=0;
// Настройка прерывания												//	*
timsk->toie2=state_ISR;
}
//----------------------------------------------------------------------*
//======================================================================*
//																		*
//	Настройка режима СОВПАДЕНИЯ и ВЫХОДА OC2	в режиме ШИМ			*
//																		*
//----------------------------------------------------------------------*
// Настройка режима СОВПАДЕНИЯ и  ВЫХОДА OC0							*
void TIMER8_2_PWM_OCR2(uint8_t OCR, // значение регистра СРАВНЕНИЯ		*
		  FunctionalState_t state_ISR, // настройка ПРЕРЫВАНИЯ			*
					 pwm_OC_t pwm) // настройка режима ВЫВОДОВ ОС0		*
{
// Настройка пина на вывод
DDR_OC2->PIN_OC2=1;
// Настройка регистра СРАВНЕНИЯ											*
#ifdef ASYNCHRONOUS_MODE											//	*
ASYN_OCR2_LOAD(OCR);	// Запись в регистр сравнения с проверкой	//	*
#else																//	*
OCR2=OCR;															//	*
#endif																//	*
// Настройка прерывания													*
timsk->ocie2=state_ISR;												//	*
// Настройка режима ВЫХОДА												*
#ifdef ASYNCHRONOUS_MODE	//если включена проверка записи			//	*
ASYN_TCR2_BYSE();			// Проверка готовности к записи			//	*
#endif																//	*
tccr2->com2=pwm;													//	*
}																	//	*
//***********************************************************************




#endif
