#ifndef TIMER16_1_c
#define TIMER16_1_c
#include <atmega16_32.h>
//***********************************************************************
//																		*
//				Работы таймера в режиме СЧЕТЧИКА						*
//																		*
//----------------------------------------------------------------------*
// Инициализация режима NORMAL											*

void TIMER16_1_NORMAL(FuncState_t state_ISR)//Состояние прерывания* 
// Вектор на прерывание: 												*
{																	//	*
// Настройка режима													//	*
tccr1b->wgm1=0;														//	*
tccr1a->wgm1=0;														//	*
// Настройка прерывания													*
timsk->toie1=state_ISR;												//	*
}																	//	*
//----------------------------------------------------------------------*
// 	Инициализация режима CTC (сброс при совпадении для регистра ICR1)	*
void TIMER16_1_CTC_ICR1(uint16_t ICR, // значение регистра перезагрузки	*
		 FuncState_t state_ISR) // состояние прерывний			*
{																	//	*
// Настройка режима														*
tccr1b->wgm1=0b11;													//	*
tccr1a->wgm1=0b00;													//	*
// Настройка регистра сброса											*
uint16hl_t temp;													//	*
temp.HL=ICR;														//	*
ICR1H=temp.H;														//	*
ICR1L=temp.L;														//	*
// Настройка прерывания													*
timsk->ticie1=state_ISR;											//	*
}																	//	*
//----------------------------------------------------------------------*
// 	Инициализация режима CTC (сброс при совпадении для регистра OCR1A)	*
void TIMER16_1_CTC_OCR1A(uint16_t OCR, // значение регистра перезагрузки*
		 FuncState_t state_ISR) // состояние прерывний			*
{																	//	*
// Настройка режима														*
tccr1b->wgm1=0b01;													//	*
tccr1a->wgm1=0b00;													//	*
// Настройка регистра сброса											*
uint16hl_t temp;													//	*
temp.HL=OCR;														//	*
OCR1AH=temp.H;														//	*
OCR1AL=temp.L;														//	*
// Настройка прерывания													*
timsk->ocie1a=state_ISR;											//	*
}																	//	*
//======================================================================*
//																		*
//	Настройка работы ВЫХОДОВ OC1A/OC1B в режиме счетчика				*
//																		*
//----------------------------------------------------------------------*
// Настройка режима ВЫХОДА OC1A											*
void TIMER16_1_COUNT_OCR1A(count_OC_t count)//настройка режима ВЫВОДОВ ОС1A*
{																	//	*
// Настройка пина на вывод											//	*
DDR_OC1->PIN_OC1A=1;												//	*
// Настройка режима ВЫХОДА												*
tccr1a->com1a=count;												//	*
}																	//	*
//----------------------------------------------------------------------*
// Настройка режима  ВЫХОДА OC1B										*
void TIMER16_1_COUNT_OCR1B(count_OC_t count)//настройка режима ВЫХОДА ОС1В*
{																	//	*
// Настройка пина на вывод												*
DDR_OC1->PIN_OC1B=1;												//	*
// Настройка режима ВЫХОДА												*
tccr1a->com1b=count;												//	*
}																	//	*
//***********************************************************************

//***********************************************************************
//																		*
//				Работы таймера в режиме Ш И М							*
//																		*
//----------------------------------------------------------------------*
// Режим Fast PWM с выбором модуля счета (8,9,10 бит)					*
void TIMER16_1_FAST_PWM_reslt(bit16_t bit, // модуль счета				*
	     	  FuncState_t state_ISR) // состояние прерывния		*
//																		*
{																	//	*
// Настройка режима														*
tccr1b->wgm1=0b01;													//	*
tccr1a->wgm1=bit;													//	*
// Настройка прерывания													*
timsk->toie1=state_ISR;												//	*
}																	//	*
//----------------------------------------------------------------------*
// Режим Fast PWM с настройкой модуля счета в регистре ICR1				*
void TIMER16_1_FAST_PWM_ICR1(uint16_t ICR, // значение рег-ра перез-ки	*
		 FuncState_t state_ISR) // состояние прерывний			*
{
// Настройка режима	
tccr1a->wgm1=0b10;
tccr1b->wgm1=0b11;
// Настройка регистра СРАВНЕНИЯ											*
uint16hl_t temp;
temp.HL=ICR;
ICR1H=temp.H;
ICR1L=temp.L;
// Настройка прерывания		
timsk->ticie1=state_ISR;
}
//----------------------------------------------------------------------*
// Режим Fast PWM с настройкой модуля счета в регистре OCR1A			*
void TIMER16_1_FAST_PWM_OCR1A(uint16_t OCR, // значение рег-ра перез-ки	*
		 FuncState_t state_ISR) // состояние прерывний			*
{
// Настройка режима	
tccr1a->wgm1=0b11;
tccr1b->wgm1=0b11;
// Настройка регистра СРАВНЕНИЯ											*
uint16hl_t temp;
temp.HL=OCR;
OCR1AH=temp.H;
OCR1AL=temp.L;
// Настройка прерывания		
timsk->ocie1a=state_ISR;
}
//----------------------------------------------------------------------*
// Режим Phase Correct PWM с выбором модуля счета (8,9,10 бит)			*
void TIMER16_1_PhasCorr_PWM_reslt(bit16_t bit, // модуль счета			*
	     		FuncState_t state_ISR) // состояние прерывния		*
{
// Настройка режима														*
tccr1b->wgm1=0b00;
tccr1a->wgm1=bit;
// Настройка прерывания													*
timsk->toie1=state_ISR;												//	*
}
//----------------------------------------------------------------------*
// Режим Phase Correct PWM с настройкой модуля счета в регистре ICR1	*
void TIMER16_1_PhaseCorr_PWM_ICR1(ph_cor_t mode,//Выбор режим Фаз.Кор-ции
					uint16_t ICR, // значение регистра перезагрузки		*
				    FuncState_t state_ISR) // состояние прерывния	*
{
// Настройка режима
tccr1b->wgm1=0b10;
tccr1a->wgm1=mode;
// Настройка регистра СРАВНЕНИЯ											*
uint16hl_t temp;
temp.HL=ICR;
ICR1H=temp.H;
ICR1L=temp.L;
// Настройка прерывания													*
timsk->ticie1=state_ISR;
}
//----------------------------------------------------------------------*
// Режим Phase Correct PWM с настройкой модуля счета в регистре OCR1A	*
void TIMER16_1_PhaseCorr_PWM_OCR1A(ph_cor_t mode,//Выбор режим Фаз.Кор-ции
					uint16_t OCR, // значение регистра перезагрузки		*
				    FuncState_t state_ISR) // состояние прерывния	*
{

// Настройка режима
tccr1b->wgm1=0b10;
tccr1a->wgm1=mode|0b01;
// Настройка регистра СРАВНЕНИЯ											*
uint16hl_t temp;
temp.HL=OCR;
OCR1AH=temp.H;
OCR1AL=temp.L;
// Настройка прерывания													*
timsk->ocie1a=state_ISR;
}
//======================================================================*
//																		*
//	Настройка в режиме Phase Correct PWM СОВПАДЕНИЯ и ВЫХОДОВ OC1A/OC1B *
//																		*
//----------------------------------------------------------------------*
// Настройка режима СОВПАДЕНИЯ и  ВЫХОДА OC1A							*
void TIMER16_1_PWM_OCR1A(uint16_t OCR, // значение регистра СРАВНЕНИЯ	*
		  FuncState_t state_ISR, // настройка ПРЕРЫВАНИЯ			*
					 pwm_OC_t count) // настройка режима ВЫВОДОВ ОС1A	*
{																		
// Настройка пина на вывод
DDR_OC1->PIN_OC1A=1;
// Настройка регистра СРАВНЕНИЯ											*
uint16hl_t temp;
temp.HL=OCR;
OCR1AH=temp.H;
OCR1AL=temp.L;
// Настройка прерывания													*
timsk->ocie1a=state_ISR;
// Настройка режима ВЫХОДА												*
tccr1a->com1a=(uint8_t)count;
}
//----------------------------------------------------------------------*
// Настройка режима СОВПАДЕНИЯ, ПРЕРЫВАНИЯ и  ВЫХОДА OC1B				*
void TIMER16_1_PWM_OCR1B(uint16_t OCR, //настройка регистра СРАВНЕНИЯ	*
		  FuncState_t state_ISR, // вкл/откл. ПРЕРЫВНИЯ			*
					 pwm_OC_t count) // настройка режима ВЫХОДА ОС1В	*
{
// Настройка пина на вывод
DDR_OC1->PIN_OC1B=1;
// Настройка регистра СРАВНЕНИЯ											*
uint16hl_t temp;
temp.HL=OCR;
OCR1BH=temp.H;
OCR1BL=temp.L;
// Настройка прерывания													*
timsk->ocie1b=state_ISR;
// Настройка режима ВЫХОДА												*
tccr1a->com1b=count;
}
//***********************************************************************



#endif
